iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОпороса/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПериодОтбораПриИзменении(Элемент)
	Перем ЭлементыОтбора;

	Список.Отбор.Элементы.Очистить();
	ЭлементыГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ЭлементыГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ЭлементыГруппаОтбора.Использование = Истина;

	ЭлементыОтбора = ЭлементыГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементыОтбора.Использование 	= Не (ПериодОтбора.ДатаНачала = '00010101000000');
	ЭлементыОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Период");
	ЭлементыОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементыОтбора.ПравоеЗначение   = ПериодОтбора.ДатаНачала;

	ЭлементыОтбора = ЭлементыГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементыОтбора.Использование 	= Не (ПериодОтбора.ДатаОкончания = '00010101000000');
	ЭлементыОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Период");
	ЭлементыОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементыОтбора.ПравоеЗначение   = ПериодОтбора.ДатаОкончания;
	КоличествоЗаписей = СписокВТЗнаСервере();

КонецПроцедуры

&НаСервере
Функция СписокВТЗнаСервере()
	// реквизит1 - динамический список на форме     
	Если Статистика Тогда
		Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип(
			"ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		МассивСсылок = ТаблицаРезультат.ВыгрузитьКолонку(0);  // выгружаем ссылки в массив для передачи клиенту  
		ЖиворожденныеКоличество = 0;
		МертвыеКоличество = 0;
		СлаборожденныеКоличество = 0;
		МуммииКоличество = 0;
		СвинкиКоличество = 0;
		МассаВсегоКоличество = 0;
		СреднийВесКоличество = 0;

		Если ТаблицаРезультат.Колонки.Найти("Живорожденные") <> Неопределено Тогда
			ЖиворожденныеКоличество = ТаблицаРезультат.Итог("Живорожденные");
		КонецЕсли;
		Если ТаблицаРезультат.Колонки.Найти("Мертвые") <> Неопределено Тогда
			МертвыеКоличество = ТаблицаРезультат.Итог("Мертвые");
		КонецЕсли;
		Если ТаблицаРезультат.Колонки.Найти("Слаборожденные") <> Неопределено Тогда
			СлаборожденныеКоличество = ТаблицаРезультат.Итог("Слаборожденные");
		КонецЕсли;
		Если ТаблицаРезультат.Колонки.Найти("Муммии") <> Неопределено Тогда
			МуммииКоличество = ТаблицаРезультат.Итог("Муммии");
		КонецЕсли;
		Если ТаблицаРезультат.Колонки.Найти("Свинки") <> Неопределено Тогда
			СвинкиКоличество = ТаблицаРезультат.Итог("Свинки");
		КонецЕсли;
		Если ТаблицаРезультат.Колонки.Найти("МассаВсего") <> Неопределено Тогда
			МассаВсегоКоличество = ТаблицаРезультат.Итог("МассаВсего");
		КонецЕсли;
		Если ТаблицаРезультат.Колонки.Найти("СреднийВес") <> Неопределено Тогда
			СреднийВесКоличество = ТаблицаРезультат.Итог("СреднийВес");
		КонецЕсли;
		КоличествоОпоросов		= МассивСсылок.Количество();
		Если КоличествоОпоросов > 0 Тогда
			Живорожденные 		= Строка(ЖиворожденныеКоличество) + " / " + Строка(ОКР(ЖиворожденныеКоличество
				/ КоличествоОпоросов, 2));
			Мертвые			 	= Строка(МертвыеКоличество) + " / " + Строка(ОКР(МертвыеКоличество
				/ КоличествоОпоросов, 2));
			Слаборожденные		= Строка(СлаборожденныеКоличество) + " / " + Строка(ОКР(СлаборожденныеКоличество
				/ КоличествоОпоросов, 2));
			Муммии				= Строка(МуммииКоличество) + " / " + Строка(ОКР(МуммииКоличество / КоличествоОпоросов,
				2));
			Свинки				= Строка(СвинкиКоличество) + " / " + Строка(ОКР(СвинкиКоличество / КоличествоОпоросов,
				2));
			МассаВсего			= Строка(МассаВсегоКоличество) + " / " + Строка(ОКР(МассаВсегоКоличество
				/ КоличествоОпоросов, 2));
			СреднийВес			= Строка(СреднийВесКоличество) + " / " + Строка(ОКР(СреднийВесКоличество
				/ КоличествоОпоросов, 2));
		КонецЕсли;
		Возврат "Кол. записей: " + Строка(КоличествоОпоросов);
	Иначе
		Живорожденные 		= "";
		Мертвые			 	= "";
		Слаборожденные		= "";
		Муммии				= "";
		Свинки				= "";
		МассаВсего			= "";
		СреднийВес			= "";
		Возврат "";
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Изменение = ВосстановитьЗначениеСервер("ЖурналОпороса.ФормаСписка", "Изменение");
	Если ЗначениеЗаполнено(Изменение) И Изменение Тогда
		КоличествоЗаписей = СписокВТЗнаСервере();
		ПоместитьВХранилище("ЖурналОпороса.ФормаСписка", "Изменение", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ХранилищеСистемныхНастроек.Сохранить("ЖурналОпороса.ФормаСписка", "Изменение", Истина);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ПоместитьВХранилище(ИмяОбъект, ИмяПараметр, Значение)

	ХранилищеСистемныхНастроек.Сохранить(ИмяОбъект, ИмяПараметр, Значение);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВосстановитьЗначениеСервер(ИмяОъект, ИмяПараметр)
	; 
	Возврат ХранилищеСистемныхНастроек.Загрузить(ИмяОъект, ИмяПараметр);
КонецФункции
&НаКлиенте
Процедура ПоследниеТриГодаПриИзменении(Элемент)
	ПериодОтбора.ДатаНачала    = '00010101';
	ПериодОтбора.ДатаОкончания = '00010101';
	Если ПоследниеТриГода Тогда
		Все = Ложь;
	Иначе
		Все = Истина;
	КонецЕсли;
	ОтборСписокСвиноматок();
	КоличествоЗаписей = СписокВТЗнаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписокСвиноматок()

	Перем ЭлементыОтбора;

	Список.Отбор.Элементы.Очистить();
	ЭлементыГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ЭлементыГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ЭлементыГруппаОтбора.Использование = Истина;

	ЭлементыОтбора = ЭлементыГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементыОтбора.Использование 	= Не Все;
	ЭлементыОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Период");
	ЭлементыОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементыОтбора.ПравоеЗначение   = ДобавитьМесяц(ТекущаяДата(), (-1) * 12 * 3);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Все = Ложь;
	Статистика = Ложь;
	ПоследниеТриГода = Истина;
	ОтборСписокСвиноматок();

КонецПроцедуры

&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
	ПериодОтбора.ДатаНачала    = '00010101';
	ПериодОтбора.ДатаОкончания = '00010101';
	Если Все Тогда
		ПоследниеТриГода = Ложь;
	Иначе
		ПоследниеТриГода = Истина;
	КонецЕсли;
	ОтборСписокСвиноматок();
	КоличествоЗаписей = СписокВТЗнаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Статистика(Команда)
	Статистика = Не Статистика;
	КоличествоЗаписей = СписокВТЗнаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрупповойВводОпоросов(Команда)
	ОткрытьФорму("РегистрСведений.ЖурналОпороса.Форма.ФормаВводаДанных", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	УдалениеНомерЖивотного 	= Элемент.ТекущиеДанные.НомерЖивотного;
	УдалениеДатаВвода		= Элемент.ТекущиеДанные.ДатаВвода;
	УдалениеДатаСобытия		= Элемент.ТекущиеДанные.Период;
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(УдалениеНомерЖивотного, УдалениеДатаВвода);
	_НастройкиКонфигурацииНаСервере.ЗаписьДанныхРегистраВЖурналРегистрацийПриУдалении(Элемент.ТекущаяСтрока,
		УдалениеНомерЖивотного, УдалениеДатаСобытия, "Удаление");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	МенюВыбора = Новый СписокЗначений;
	МенюВыбора.Добавить(0, "Открыть карточку опороса");
	МенюВыбора.Добавить(1, "Открыть карточку свиноматки");
	ВыбСтрокаМеню = ВыбратьИзМеню(МенюВыбора);
	Попытка
		Если ВыбСтрокаМеню.Значение = 1 Тогда
			СтандартнаяОбработка = Ложь;
			Попытка
				НомерЖивотного 	= Элемент.ТекущиеДанные.НомерЖивотного;
				ДатаВвода		= Элемент.ТекущиеДанные.ДатаВвода;
				ОткрытьФорму("РегистрСведений.КарточкаСвиноматки.Форма.ФормаЗаписи",
					Новый Структура("Ключ, ФормаОткрыта", _НастройкиКонфигурацииНаСервере.ПолучитьКлючЗаписи(
					НомерЖивотного, ДатаВвода), Ложь), , , , , , );
			Исключение 
				//Сообщить(Строка(Строка.НомерЖивотного)+"_"+ Строка.Период);
			КонецПопытки;
		КонецЕсли;
	Исключение
		СтандартнаяОбработка = Ложь;
	КонецПопытки;
КонецПроцедуры
